import { ProductsDetail } from "@/shared/types/productsDetail";
import Script from "next/script";
import { useState } from "react";

export default function Credit({

  product,
  currentCity,
}: {
  product: ProductsDetail | null;
  currentCity: string;
}) {

  const [rerender, setRerender] = useState(false);

  const kaspiCity: Record<string, number> = {
    Абай: 353220100,//ok
    Акколь: 113220100,
    Аксай: 273620100,
    Аксу: 551610000,
    Актау: 471010000,
    Актобе: 151010000, //ok
    Алматы: 750000000,//ok
    Алтай: 634820100,
    Аральск: 433220100,
    Аркалык: 391610000,
    Арысь: 511610000,
    Астана: 710000000, //ok
    Атырау: 231010000, // ok
    Аягоз: 633420100,
    Байконыр: 431910000,
    Балхаш: 351610000,
    Бейнеу: 473630100,
    Есик: 194020100,
    Жанаозен: 471810000,
    Жаркент: 195620100,
    Жезказган: 351810000,
    Жетысай: 514420100,
    Житикара: 394420100,
    Зайсан: 634620100,
    Кандыагаш: 154820100,
    Караганда: 351010000, //ok
    Каратау: 316220100,
    Каскелен: 195220100, // ok
    Кентау: 612010000,
    Кокшетау: 111010000,
    Конаев: 191610000,
    Костанай: 391010000,//change
    Кульсары: 233620100,
    Курчатов: 632210000,
    Кызылорда: 431010000,
    Ленгер: 515820100,
    Лисаковск: 392010000,
    Павлодар: 551010000, // ok
    Петропавловск: 591010000, // ok
    Риддер: 156420100,
    Рудный: 392410000, //ok
    Сарань: 352210000, // ok
    Сарыагаш: 515420100,
    Сатпаев: 352310000,
    Семей: 632810000, // ok
    Степногорск: 111810000,
    Талгар: 196220100, // ok
    Талдыкорган: 191010000,
    Тараз: 311010000,
    Текели: 192610000,
    Темиртау: 352410000,
    Туркестан: 512610000,
    Уральск: 271010000,
    "Усть-Каменогорск": 631010000, // ok
    Уштобе: 195020100,
    "Форт-Шевченко": 475220100,
    Хромтау: 156020100,
    Шардара: 616420100,
    Шахтинск: 352810000, // ok
    Шемонаиха: 636820100,
    Шиели: 117055900,
    Шу: 316621100,
    Шымкент: 511010000, // ok
    Щучинск: 117020100,
    Экибастуз: 552210000, // ok
    "п. Глубокое": 634030100,
    "п. Железинка": 554230100,
    "п. Жетыбай": 474239100,
    "п. Курык": 474230100,
    "п. Тобыл": 395430100,
    "п. Шетпе": 474630100,
    "с. Аксукент": 515230100,
    "с. Алга": 153220100,
    "с. Зачаганск": 271035100,
    "с. Кордай": 314851205,
    "с. Косшы": 116651100,
    "с. Узынагаш": 194230100,
  };

  return (
    <>
      <div
        className="ks-widget"
        data-template="button"
        data-merchant-sku={product?.vendor_code}
        data-merchant-code="BUGA"
        data-city={String(kaspiCity[currentCity] ?? "591010000")}

      ></div>
      <div
        className="forte-btn"
        data-merchant-id="A2YN7r1ivpxijOlp1E"
        data-articul={product?.vendor_code}
        data-city-id={"KZ-SEV-591010000"}
        data-theme="dark"
      ></div>
      <Script
        onReady={() => setRerender(!rerender)}
        id="KS-Widget"
        src="https://kaspi.kz/kaspibutton/widget/ks-wi_ext.js"
      />
      <Script
        onReady={() => setRerender(!rerender)}
        type="text/javascript"
        src="https://cdn-1.forte.kz/assets/forte-market-scripts/buy-credit.js"
      />
    </>
  );
}
